# Вариант 3. Задачи 3, 5, 7, 12\
#  Осортировать строку В порядке увеличения разницы между частотой наиболее часто
# встречаемого символа в строке и частотой его появления в алфавите.
Aorder = {
    'а': 0.08, 'б': 0.015, 'в': 0.045, 'г': 0.017, 'д': 0.03, 'е': 0.087, 'ё': 0.014, 'ж': 0.009, 'з': 0.016, 
    'и': 0.073, 'й': 0.012, 'к': 0.034, 'л': 0.044, 'м': 0.032, 'н': 0.067, 'о': 0.11, 'п': 0.028, 'р': 0.047, 
    'с': 0.054, 'т': 0.063, 'у': 0.026, 'ф': 0.002, 'х': 0.009, 'ц': 0.004, 'ч': 0.014, 'ш': 0.007, 'щ': 0.003, 
    'ъ': 0.014, 'ы': 0.019, 'ь': 0.017, 'э': 0.003, 'ю': 0.006, 'я': 0.018,
    'a': 0.08167, 'b': 0.01492, 'c': 0.02782, 'd': 0.04253, 'e': 0.12702, 'f': 0.02228, 'g': 0.02015, 
    'h': 0.06094, 'i': 0.06966, 'j': 0.00153, 'k': 0.00772, 'l': 0.04025, 'm': 0.02406, 'n': 0.06749, 
    'o': 0.07507, 'p': 0.01929, 'q': 0.00095, 'r': 0.05987, 's': 0.06327, 't': 0.09056, 'u': 0.02758, 
    'v': 0.00978, 'w': 0.02360, 'x': 0.00150, 'y': 0.01974, 'z': 0.00074
}
def order(s):
    f = {}
    for c in s.lower():
            f[c] = f.get(c, 0) + 1
    return f
def delta(x,s):
    orderINS = order(s)
    #print(orderINS)
    if not orderINS:
        return 0
    print(abs(orderINS[x] / len(s) - Aorder.get(x, 0)), " - ",x)
    return abs(orderINS[x] / len(s) - Aorder.get(x, 0))
def sort(s):
    return ''.join(sorted(s, key=lambda x: delta(x,s)))


a = input("Введите строку: ")
print(sort(a))
